mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
// cLcd.cpp
//{{{  includes
#include <string>
#include <sstream>
#include <iostream>
#include <iomanip>

#include "memory.h"
#include "stm32746g_disco.h"
#include "stm32f7xx_hal_dma2d.h"

#include "cLcd.h"
#include "cLcdPrivate.h"

#include "cmsis_os.h"
#include "cpuUsage.h"

#include <ft2build.h>
#include FT_FREETYPE_H

extern int freeSansBold_len;
extern const uint8_t freeSansBold[64228];
//}}}
//{{{  defines
#define ABS(X) ((X) > 0 ? (X) : -(X))

#define LCD_DISP_PIN           GPIO_PIN_12
#define LCD_DISP_GPIO_PORT     GPIOI

#define LCD_BL_CTRL_PIN        GPIO_PIN_3
#define LCD_BL_CTRL_GPIO_PORT  GPIOK

#define kWipe  1
#define kStamp 2
//}}}
//{{{  static vars
static uint32_t curFrameBufferAddress;
static uint32_t setFrameBufferAddress[2];
static uint32_t showFrameBufferAddress[2];
static uint8_t showAlpha[2];

//{{{  struct tLTDC
typedef struct {
  osSemaphoreId sem;
  uint32_t timeouts;
  uint32_t lineIrq;
  uint32_t fifoUnderunIrq;
  uint32_t transferErrorIrq;
  uint32_t lastTicks;
  uint32_t lineTicks;
  uint32_t frameWait;
  } tLTDC;
//}}}
static tLTDC ltdc;

static uint32_t* mDma2dBuf = nullptr;
static uint32_t* mDma2dIsrBuf = nullptr;
static osSemaphoreId mDma2dSem;

#define maxChars 0x60
//{{{  struct tFontChar
typedef struct {
  uint8_t* bitmap;
  int16_t left;
  int16_t top;
  int16_t pitch;
  int16_t rows;
  int16_t advance;
  } tFontChar;
//}}}
static tFontChar* chars[maxChars];

static FT_Library FTlibrary;
static FT_Face FTface;
static FT_GlyphSlot FTglyphSlot;
//}}}

LTDC_HandleTypeDef hLtdc;
//{{{
void LCD_LTDC_IRQHandler() {

  if (LTDC->ISR & LTDC_IT_FU) ltdc.fifoUnderunIrq++;
  if (LTDC->ISR & LTDC_IT_TE) ltdc.transferErrorIrq++;

  // line interrupt
  if (LTDC->ISR & LTDC_IT_LI) {
    // switch showFrameBuffer
    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;

    ltdc.lineTicks = osKernelSysTick() - ltdc.lastTicks;
    ltdc.lastTicks = osKernelSysTick();
    ltdc.lineIrq++;

    if (ltdc.frameWait)
      osSemaphoreRelease (ltdc.sem);
    ltdc.frameWait = 0;
    }

  LTDC->ICR = LTDC_FLAG_LI | LTDC_FLAG_FU | LTDC_FLAG_TE;
  }
//}}}
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupt flags
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  while (true) {
    switch (*mDma2dIsrBuf++) {
      case kWipe:
        DMA2D->OCOLR = *mDma2dIsrBuf++;  // colour
        DMA2D->OMAR  = *mDma2dIsrBuf++;  // fb start address
        DMA2D->OOR   = *mDma2dIsrBuf++;  // stride
        DMA2D->NLR   = *mDma2dIsrBuf++;  // width:height
        DMA2D->CR = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        return;

      case kStamp:
        DMA2D->FGCOLR = *mDma2dIsrBuf++; // src color
        DMA2D->OMAR   = *mDma2dIsrBuf;   // bgnd fb start address
        DMA2D->BGMAR  = *mDma2dIsrBuf++;
        DMA2D->OOR    = *mDma2dIsrBuf;   // bgnd stride
        DMA2D->BGOR   = *mDma2dIsrBuf++;
        DMA2D->NLR    = *mDma2dIsrBuf++; // width:height
        DMA2D->FGMAR  = *mDma2dIsrBuf++; // src start address
        DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        return;

      default: // normally 0
        // no more opCodes, disable interrupts and release semaphore to signal done
        DMA2D->CR = 0;
        mDma2dIsrBuf = mDma2dBuf;
        osSemaphoreRelease (mDma2dSem);
        return;
      }
    }
  }
//}}}

cLcd* cLcd::mLcd = nullptr;

#ifdef STM32F769xx
//{{{  defines
#define LCD_OTM8009A_ID  ((uint32_t) 0)
#define LCD_DSI_PIXEL_DATA_FMT_RBG888  DSI_RGB888 /*!< DSI packet pixel format chosen is RGB888 : 24 bpp */
#define LCD_DSI_PIXEL_DATA_FMT_RBG565  DSI_RGB565 /*!< DSI packet pixel format chosen is RGB565 : 16 bpp */

typedef enum
{
  LCD_ORIENTATION_PORTRAIT  = 0x00, /*!< Portrait orientation choice of LCD screen  */
  LCD_ORIENTATION_LANDSCAPE = 0x01, /*!< Landscape orientation choice of LCD screen */
  LCD_ORIENTATION_INVALID   = 0x02  /*!< Invalid orientation choice of LCD screen   */
} LCD_OrientationTypeDef;
//{{{  OTM8009A defines
#define OTM8009A_ORIENTATION_PORTRAIT    ((uint32_t)0x00) /* Portrait orientation choice of LCD screen  */
#define OTM8009A_ORIENTATION_LANDSCAPE   ((uint32_t)0x01) /* Landscape orientation choice of LCD screen */

#define OTM8009A_FORMAT_RGB888    ((uint32_t)0x00) /* Pixel format chosen is RGB888 : 24 bpp */
#define OTM8009A_FORMAT_RBG565    ((uint32_t)0x02) /* Pixel format chosen is RGB565 : 16 bpp */

/* Width and Height in Portrait mode */
#define  OTM8009A_480X800_WIDTH             ((uint16_t)480)     /* LCD PIXEL WIDTH   */
#define  OTM8009A_480X800_HEIGHT            ((uint16_t)800)     /* LCD PIXEL HEIGHT  */

/* Width and Height in Landscape mode */
#define  OTM8009A_800X480_WIDTH             ((uint16_t)800)     /* LCD PIXEL WIDTH   */
#define  OTM8009A_800X480_HEIGHT            ((uint16_t)480)     /* LCD PIXEL HEIGHT  */

// OTM8009A_480X800 Timing parameters for Portrait orientation mode
#define  OTM8009A_480X800_HSYNC             ((uint16_t)63)     /* Horizontal synchronization: This value is set to limit value mentionned
                                                                   in otm8009a spec to fit with USB functional clock configuration constraints */
#define  OTM8009A_480X800_HBP               ((uint16_t)120)     /* Horizontal back porch      */
#define  OTM8009A_480X800_HFP               ((uint16_t)120)     /* Horizontal front porch     */
#define  OTM8009A_480X800_VSYNC             ((uint16_t)12)      /* Vertical synchronization   */
#define  OTM8009A_480X800_VBP               ((uint16_t)12)      /* Vertical back porch        */
#define  OTM8009A_480X800_VFP               ((uint16_t)12)      /* Vertical front porch       */

// OTM8009A_800X480 Timing parameters for Landscape orientation mode
//         Same values as for Portrait mode in fact.
#define  OTM8009A_800X480_HSYNC             OTM8009A_480X800_HSYNC  /* Horizontal synchronization */
#define  OTM8009A_800X480_HBP               OTM8009A_480X800_HBP    /* Horizontal back porch      */
#define  OTM8009A_800X480_HFP               OTM8009A_480X800_HFP    /* Horizontal front porch     */
#define  OTM8009A_800X480_VSYNC             OTM8009A_480X800_VSYNC  /* Vertical synchronization   */
#define  OTM8009A_800X480_VBP               OTM8009A_480X800_VBP    /* Vertical back porch        */
#define  OTM8009A_800X480_VFP               OTM8009A_480X800_VFP    /* Vertical front porch       */

