mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  /* Gamma correction 2.2+ table (HSDT possible) */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);
  DSI_IO_WriteCmd (16, (uint8_t*)lcdRegData3);

  /* Gamma correction 2.2- table (HSDT possible) */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);
  DSI_IO_WriteCmd (16, (uint8_t*)lcdRegData4);

  /* Send Sleep Out command to display : no parameter */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData36);

  /* Wait for sleep out exit*/
  HAL_Delay (120);

  switch (ColorCoding) {
    case OTM8009A_FORMAT_RBG565 : /* Set Pixel color format to RGB565 */
      DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData37);
      break;
    case OTM8009A_FORMAT_RGB888 : /* Set Pixel color format to RGB888 */
      DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData38);
      break;
    default :
      break;
    }

  // Send command to configure display in landscape orientation mode. By default the orientation mode is portrait
  if (orientation == OTM8009A_ORIENTATION_LANDSCAPE) {
    DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData39);
    DSI_IO_WriteCmd (4, (uint8_t*)lcdRegData27);
    DSI_IO_WriteCmd (4, (uint8_t*)lcdRegData28);
    }

  // CABC : Content Adaptive Backlight Control section start
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData40); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness, try 0x7F : intermediate value
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData41); // defaut is 0, try 0x2C - Brightness Control Block, Display Dimming & BackLight on
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData42); // defaut is 0, try 0x02 - image Content based Adaptive Brightness [Still Picture]
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData43); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness

  /* Send Command Display On */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData44);

  /* NOP command */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData1);

  /* Send Command GRAM memory write (no parameters) : this initiates frame write via other DSI commands sent by */
  /* DSI host from LTDC incoming pixels in video mode */
  DSI_IO_WriteCmd (0, (uint8_t*)ShortRegData45);
  }
//}}}
#endif

// cLcd
//{{{
cLcd::cLcd (uint32_t buffer0, uint32_t buffer1)  {

  mStartTime = osKernelSysTick();

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;

  updateNumDrawLines();
  }
//}}}
cLcd::~cLcd() {}

// static members
//{{{
cLcd* cLcd::create (std::string title, bool buffered) {

  if (!mLcd) {
    mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
    mLcd->init (title, buffered);
    }

  return mLcd;
  }
//}}}
//{{{
std::string cLcd::hex (int value, uint8_t width) {

  std::ostringstream os;
  if (width)
    os << std::hex << std::setfill ('0') << std::setw (width) << value;
  else
    os << std::hex << value;
  return os.str();
  }
//}}}
//{{{
std::string cLcd::dec (int value, uint8_t width, char fill) {

  std::ostringstream os;
  if (width)
    os << std::setfill (fill) << std::setw (width) << value;
  else
    os << value;
  return os.str();
  }
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

  mShowTitle = title;
  mShowInfo = info;
  mShowLcdStats = lcdStats;
  mShowFooter = footer;

  updateNumDrawLines();
  }
//}}}

//{{{
void cLcd::info (uint32_t colour, std::string str, bool newLine) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (newLine && (mLastLine < mMaxLine-1)) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  if (newLine)
    mLastLine = line;

  if (tailing)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  }
//}}}
//{{{
void cLcd::info (std::string str, bool newLine) {
  info (COL_WHITE, str, newLine);
  }
//}}}

//{{{
void cLcd::press (int pressCount, int x, int y, int z, int xinc, int yinc) {

  if ((pressCount > 30) && (x <= mStringPos) && (y <= getLineHeight()))
    reset();
  else if (pressCount == 0) {
    if (x <= mStringPos) {
      // set displayFirstLine
      if (y < 2 * getLineHeight())
        displayTop();
      else if (y > getHeight() - 2 * getLineHeight())
        displayTail();
      }
    }
  else {
    // inc firstLine
    float value = mFirstLine - ((2.0f * yinc) / getLineHeight());

    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::startRender() {

  if (mBuffered) {
    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);

    // frameSync;
    ltdc.frameWait = 1;
    if (osSemaphoreWait (ltdc.sem, 100) != osOK)
      ltdc.timeouts++;
    }

  mDrawStartTime = osKernelSysTick();
  }
//}}}
//{{{
void cLcd::renderCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
  ellipse (colour, x, y, z, z);
  }
//}}}
//{{{
void cLcd::endRender() {

  auto y = 0;
  if (mShowTitle && !mTitle.empty()) {
    //{{{  draw title
    text (COL_WHITE, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
    //}}}
  if (mShowInfo) {
    //{{{  draw info lines
    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
      auto height = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
      rectClipped (COL_YELLOW, 0, yorg, 8, height);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      auto x = 0;
      auto xinc = text (COL_GREEN, getFontHeight(),
                        dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                        dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
      x += xinc + 3;
      text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
      y += getLineHeight();
      }
    }
    //}}}
  if (mShowLcdStats) {
    //{{{  draw lcdStats
    std::string str = dec (ltdc.lineIrq) + ":f " +
                  dec (ltdc.lineTicks) + "ms " +
                      dec (mDma2dHighWater-mDma2dBuf) + ":hi " +
                      dec (mDma2dTimeouts) + " " +
                      dec (ltdc.transferErrorIrq) + " " +
                      dec (ltdc.fifoUnderunIrq);
    text (COL_WHITE, getFontHeight(), str, 0, getHeight() - 2 * getLineHeight(), getWidth(), 24);
    }
    //}}}
  if (mShowFooter)
    //{{{  draw footer
    text (COL_YELLOW, getFontHeight(),
          dec (xPortGetFreeHeapSize()) + " " + dec (osGetCPUUsage()) + "% " + dec (mDrawTime) + "ms",
          0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
    //}}}

  sendWait();
  showLayer (0, mBuffer[mDrawBuffer], 255);

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}

