mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
//{{{
void cLcd::displayOn() {

  #ifdef STM32F746xx
    // enable LTDC
    LTDC->GCR |= LTDC_GCR_LTDCEN;

    // turn on DISP pin
    HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);        /* Assert LCD_DISP pin */

    // turn on backlight
    HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);  /* Assert LCD_BL_CTRL pin */
  #endif

  #ifdef STM32F769xx
    /* Send Display on DCS command to display */
    HAL_DSI_ShortWrite (&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1,
                        OTM8009A_CMD_DISPON, 0x00);
  #endif
  }
//}}}
//{{{
void cLcd::displayOff() {

   #ifdef STM32F746xx
    // disable LTDC
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    // turn off DISP pin
    HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET);      /* De-assert LCD_DISP pin */

    // turn off backlight
    HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);/* De-assert LCD_BL_CTRL pin */
  #endif

  #ifdef STM32F769xx
    /* Send Display off DCS Command to display */
    HAL_DSI_ShortWrite (&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1,
                        OTM8009A_CMD_DISPOFF, 0x00);
  #endif
  }
//}}}

// iDraw
//{{{
void cLcd::pixel (uint32_t colour, int16_t x, int16_t y) {

  if (mBuffered)
    rect (colour, x, y, 1, 1);
  else
    *(uint32_t*)(curFrameBufferAddress + (y*getWidth() + x)*4) = colour;
  }
//}}}
//{{{
void cLcd::rect (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  if (mBuffered) {
    *mDma2dCurBuf++ = colour;                                             // colour
    *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // fb start address
    *mDma2dCurBuf++ = getWidth() - width;                                 // stride
    *mDma2dCurBuf++ = (width << 16) | height;                             // width:height
    *mDma2dCurBuf++ = 0;                                                  // terminate
    *(mDma2dCurBuf-6) = kWipe;                                            // fill opCode

    if (mDma2dCurBuf > mDma2dHighWater)
      mDma2dHighWater = mDma2dCurBuf;
    }

  else {
    DMA2D->OCOLR = colour;
    DMA2D->OMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->OOR   = getWidth() - width;
    DMA2D->NLR   = (width << 16) | height;
    DMA2D->CR = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
    DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                   DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
    }

  }
//}}}
//{{{
void cLcd::stamp (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  if (mBuffered) {
    *mDma2dCurBuf++ = colour;                                             // colour
    *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // bgnd fb start address
    *mDma2dCurBuf++ = getWidth() - width;                                 // stride
    *mDma2dCurBuf++ = (width << 16) | height;                             // width:height
    *mDma2dCurBuf++ = (uint32_t)src;                                      // src start address
    *mDma2dCurBuf++ = 0;                                                  // terminate
    *(mDma2dCurBuf-7) = kStamp;                                           // stamp opCode

    if (mDma2dCurBuf > mDma2dHighWater)
      mDma2dHighWater = mDma2dCurBuf;
    }

  else {
    DMA2D->FGCOLR = colour;
    DMA2D->OMAR   = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->BGMAR  = curFrameBufferAddress + ((y * getWidth()) + x) * 4;
    DMA2D->OOR    = getWidth() - width;
    DMA2D->BGOR   = getWidth() - width;
    DMA2D->NLR    = (width << 16) | height;
    DMA2D->FGMAR  = (uint32_t)src;
    DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    while (!(DMA2D->ISR & DMA2D_ISR_TCIF)) {}
    DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                   DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
    }
  }
//}}}
//{{{
int cLcd::text (uint32_t colour, int fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  for (unsigned int i = 0; i < str.size(); i++) {
    if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
      auto fontChar = chars[str[i] - 0x20];
      if (!fontChar) {
        FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
        FT_Load_Char (FTface, str[i], FT_LOAD_RENDER);

        // cache char info
        fontChar = (tFontChar*)pvPortMalloc (sizeof(tFontChar));
        chars[str[i] - 0x20] = fontChar;
        fontChar->left = FTglyphSlot->bitmap_left;
        fontChar->top = FTglyphSlot->bitmap_top;
        fontChar->pitch = FTglyphSlot->bitmap.pitch;
        fontChar->rows = FTglyphSlot->bitmap.rows;
        fontChar->advance = FTglyphSlot->advance.x / 64;
        fontChar->bitmap = nullptr;

        if (FTglyphSlot->bitmap.buffer) {
          // cache char bitmap
          fontChar->bitmap = (uint8_t*)pvPortMalloc (FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
          memcpy (fontChar->bitmap, FTglyphSlot->bitmap.buffer, FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
          }
        }

      if (x + fontChar->left + fontChar->pitch >= width)
        break;
      else if (fontChar->bitmap)
        stampClipped (colour, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

      x += fontChar->advance;
      }
    }

  return x;
  }
//}}}
//{{{
void cLcd::copy (uint32_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {
  }
//}}}
//{{{
void cLcd::copy (ID2D1Bitmap* bitMap, int16_t x, int16_t y, uint16_t width, uint16_t height) {
  }
//}}}

//{{{
void cLcd::pixelClipped (uint32_t colour, int16_t x, int16_t y) {

    rectClipped (colour, x, y, 1, 1);
  }
//}}}
//{{{
void cLcd::stampClipped (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  if (!width || !height || x < 0)
    return;

  if (y < 0) {
    // top clip
    if (y + height <= 0)
      return;
    height += y;
    src += -y * width;
    y = 0;
    }

  if (y + height > getHeight()) {
    // bottom yclip
    if (y >= getHeight())
      return;
    height = getHeight() - y;
    }

  stamp (colour, src, x, y, width, height);
  }
//}}}
//{{{
void cLcd::rectClipped (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  if (x >= getWidth())
    return;
  if (y >= getHeight())
    return;

  int xend = x + width;
  if (xend <= 0)
    return;

  int yend = y + height;
  if (yend <= 0)
    return;

  if (x < 0)
    x = 0;
  if (xend > getWidth())
    xend = getWidth();

