mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  // GPIOK config
  gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init (GPIOK, &gpio_init_structure);

  // LCD_DISP GPIO config
  gpio_init_structure.Pin       = LCD_DISP_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init (LCD_DISP_GPIO_PORT, &gpio_init_structure);

  // LCD_BL_CTRL GPIO config
  gpio_init_structure.Pin       = LCD_BL_CTRL_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init (LCD_BL_CTRL_GPIO_PORT, &gpio_init_structure);
  //}}}
  //{{{  LTDC timing config
  #define RK043FN48H_WIDTH   480 // LCD PIXEL WIDTH
  #define RK043FN48H_HSYNC   41  // Horizontal synchronization
  #define RK043FN48H_HBP     13  // Horizontal back porch
  #define RK043FN48H_HFP     32  // Horizontal front porch

  #define RK043FN48H_HEIGHT  272 // LCD PIXEL HEIGHT
  #define RK043FN48H_VSYNC   10  // Vertical synchronization
  #define RK043FN48H_VBP     2   // Vertical back porch
  #define RK043FN48H_VFP     2   // Vertical front porch

  hLtdc.Init.HorizontalSync =     RK043FN48H_HSYNC - 1;
  hLtdc.Init.AccumulatedHBP =     RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
  hLtdc.Init.AccumulatedActiveW = RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
  hLtdc.Init.TotalWidth =         RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP + RK043FN48H_HFP - 1;

  hLtdc.Init.VerticalSync =       RK043FN48H_VSYNC - 1;
  hLtdc.Init.AccumulatedVBP =     RK043FN48H_VSYNC + RK043FN48H_VBP - 1;
  hLtdc.Init.AccumulatedActiveH = RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP - 1;
  hLtdc.Init.TotalHeigh =         RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP + RK043FN48H_VFP - 1;

  // - PLLSAI_VCO In  = HSE_VALUE / PLLM                        = 1 Mhz
  // - PLLSAI_VCO Out = PLLSAI_VCO Input * PLLSAIN              = 192 Mhz
  // - PLLLCDCLK      = PLLSAI_VCO Output / PLLSAIR    = 192/5  = 38.4 Mhz
  // - LTDC clock     = PLLLCDCLK / LTDC_PLLSAI_DIVR_4 = 38.4/4 = 9.6Mhz
  RCC_PeriphCLKInitTypeDef periph_clk_init_struct;
  periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  periph_clk_init_struct.PLLSAI.PLLSAIN = 192;
  periph_clk_init_struct.PLLSAI.PLLSAIR = 5; // could be 7
  periph_clk_init_struct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
  HAL_RCCEx_PeriphCLKConfig (&periph_clk_init_struct);
  //}}}
  //{{{  LTDC Polarity
  hLtdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hLtdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hLtdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hLtdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  //}}}
  //{{{  LTDC width height
  hLtdc.LayerCfg->ImageWidth = RK043FN48H_WIDTH;
  hLtdc.LayerCfg->ImageHeight = RK043FN48H_HEIGHT;
  //}}}
  //{{{  LTDC Background value
  hLtdc.Init.Backcolor.Blue = 0;
  hLtdc.Init.Backcolor.Green = 0;
  hLtdc.Init.Backcolor.Red = 0;
  //}}}
  hLtdc.Instance = LTDC;
  HAL_LTDC_Init (&hLtdc);
  #endif

  #ifdef STM32F769xx
  //{{{  DSI LCD
  uint32_t LcdClock  = 27429; /*!< LcdClk = 27429 kHz */

  //{{{  Toggle Hardware Reset of the DSI LCD using * its XRES signal (active low) */
  __HAL_RCC_GPIOJ_CLK_ENABLE();

  // Configure the GPIO on PJ15
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Pin   = GPIO_PIN_15;
  gpio_init_structure.Mode  = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull  = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init (GPIOJ, &gpio_init_structure);

  // pulse XRES active low
  HAL_GPIO_WritePin (GPIOJ, GPIO_PIN_15, GPIO_PIN_RESET);
  HAL_Delay(20);
  HAL_GPIO_WritePin (GPIOJ, GPIO_PIN_15, GPIO_PIN_SET);
  HAL_Delay(10);
  //}}}

  // MSP Initialize set IP blocks LTDC, DSI and DMA2D  out of reset clocked  NVIC IRQ related to IP blocks enabled
  //BSP_LCD_MspInit();

  // DSI Init, set base address of DSI Host/Wrapper registers
  hdsi_discovery.Instance = DSI;
  HAL_DSI_DeInit (&(hdsi_discovery));

  // enable the LTDC and DMA2D clocks
  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_DMA2D_CLK_ENABLE();
  __HAL_RCC_DSI_CLK_ENABLE();

  DSI_PLLInitTypeDef dsiPllInit;
  dsiPllInit.PLLNDIV = 100;
  dsiPllInit.PLLIDF = DSI_PLL_IN_DIV5;
  dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;
  uint32_t laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */
  hdsi_discovery.Init.NumberOfLanes = DSI_TWO_DATA_LANES;
  hdsi_discovery.Init.TXEscapeCkdiv = laneByteClk_kHz/15620; // TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4
  HAL_DSI_Init (&(hdsi_discovery), &(dsiPllInit));

  //  lcd_x_size = OTM8009A_480X800_WIDTH;  /* 480 */
  //  lcd_y_size = OTM8009A_480X800_HEIGHT; /* 800 */
  lcd_x_size = OTM8009A_800X480_WIDTH;  /* 800 */
  lcd_y_size = OTM8009A_800X480_HEIGHT; /* 480 */

  uint32_t HACT = lcd_x_size; /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */
  uint32_t VACT = lcd_y_size; /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */

  // The following values are same for portrait and landscape orientations
  uint32_t VSA = OTM8009A_480X800_VSYNC; // 12  - Vertical start active time in units of lines
  uint32_t VBP = OTM8009A_480X800_VBP;   // 12  - Vertical Back Porch time in units of lines
  uint32_t VFP = OTM8009A_480X800_VFP;   // 12  - Vertical Front Porch time in units of lines
  uint32_t HSA = OTM8009A_480X800_HSYNC; // 63  - Horizontal start active time in units of lcdClk
  uint32_t HBP = OTM8009A_480X800_HBP;   // 120 - Horizontal Back Porch time in units of lcdClk
  uint32_t HFP = OTM8009A_480X800_HFP;   // 120 - Horizontal Front Porch time in units of lcdClk

  hdsivideo_handle.ColorCoding          = LCD_DSI_PIXEL_DATA_FMT_RBG888;
  hdsivideo_handle.VSPolarity           = DSI_VSYNC_ACTIVE_HIGH;
  hdsivideo_handle.HSPolarity           = DSI_HSYNC_ACTIVE_HIGH;
  hdsivideo_handle.DEPolarity           = DSI_DATA_ENABLE_ACTIVE_HIGH;
  hdsivideo_handle.Mode                 = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
  hdsivideo_handle.NullPacketSize       = 0xFFF;
  hdsivideo_handle.NumberOfChunks       = 0;
  hdsivideo_handle.PacketSize           = HACT; /* Value depending on display orientation choice portrait/landscape */
  hdsivideo_handle.HorizontalSyncActive = (HSA * laneByteClk_kHz) / LcdClock;
  hdsivideo_handle.HorizontalBackPorch  = (HBP * laneByteClk_kHz) / LcdClock;
  hdsivideo_handle.HorizontalLine       = ((HACT + HSA + HBP + HFP) * laneByteClk_kHz)/LcdClock; /* Value depending on display orientation choice portrait/landscape */
  hdsivideo_handle.VerticalSyncActive   = VSA;
  hdsivideo_handle.VerticalBackPorch    = VBP;
  hdsivideo_handle.VerticalFrontPorch   = VFP;
  hdsivideo_handle.VerticalActive       = VACT; /* Value depending on display orientation choice portrait/landscape */
  hdsivideo_handle.LPCommandEnable      = DSI_LP_COMMAND_ENABLE; // Enable sending LP command while streaming active in video mode */
  hdsivideo_handle.LPLargestPacketSize  = 16; // Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions
  hdsivideo_handle.LPVACTLargestPacketSize = 0;  // Largest packet size possible to transmit in LP mode in HFP region during VACT period
  hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;    /* Allow sending LP commands during HFP period */
  hdsivideo_handle.LPHorizontalBackPorchEnable  = DSI_LP_HBP_ENABLE;    /* Allow sending LP commands during HBP period */
  hdsivideo_handle.LPVerticalActiveEnable       = DSI_LP_VACT_ENABLE;   /* Allow sending LP commands during VACT period */
  hdsivideo_handle.LPVerticalFrontPorchEnable   = DSI_LP_VFP_ENABLE;    /* Allow sending LP commands during VFP period */
  hdsivideo_handle.LPVerticalBackPorchEnable    = DSI_LP_VBP_ENABLE;    /* Allow sending LP commands during VBP period */
  hdsivideo_handle.LPVerticalSyncActiveEnable    = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */
  HAL_DSI_ConfigVideoMode (&(hdsi_discovery), &(hdsivideo_handle));

