mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  // LTDC init
  hLtdc.Instance = LTDC;

  /* Timing Configuration */
  hLtdc.Init.HorizontalSync = (HSA - 1);
  hLtdc.Init.AccumulatedHBP = (HSA + HBP - 1);
  hLtdc.Init.AccumulatedActiveW = (lcd_x_size + HSA + HBP - 1);
  hLtdc.Init.TotalWidth = (lcd_x_size + HSA + HBP + HFP - 1);

  /* Initialize the LCD pixel width and pixel height */
  hLtdc.LayerCfg->ImageWidth  = lcd_x_size;
  hLtdc.LayerCfg->ImageHeight = lcd_y_size;

  // LCD clock configuration
  // Note: The following values should not be changed as the PLLSAI is also used to clock the USB FS
  // PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz
  // PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN = 384 Mhz
  // PLLLCDCLK = PLLSAI_VCO Output/PLLSAIR = 384 MHz / 7 = 54.85 MHz
  // LTDC clock frequency = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 54.85 MHz / 2 = 27.429 MHz
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 7;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
  HAL_RCCEx_PeriphCLKConfig (&PeriphClkInitStruct);

  /* Background value */
  hLtdc.Init.Backcolor.Blue = 0;
  hLtdc.Init.Backcolor.Green = 0;
  hLtdc.Init.Backcolor.Red = 0;
  hLtdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  hLtdc.Instance = LTDC;

  /* Get LTDC Configuration from DSI Configuration */
  HAL_LTDC_StructInitFromVideoConfig (&(hLtdc), &(hdsivideo_handle));

  /* Initialize the LTDC */
  HAL_LTDC_Init (&hLtdc);
  HAL_DSI_Start (&hdsi_discovery);
  OTM8009A_Init (OTM8009A_FORMAT_RGB888, LCD_ORIENTATION_LANDSCAPE);
  //}}}
  #endif

  layerInit (0, frameBufferAddress);
  setFrameBufferAddress[1] = frameBufferAddress;
  showFrameBufferAddress[1] = frameBufferAddress;
  showAlpha[1] = 0;

  if (mBuffered) {
    //{{{  LTDC IRQ init
    osSemaphoreDef (ltdcSem);
    ltdc.sem = osSemaphoreCreate (osSemaphore (ltdcSem), -1);

    ltdc.timeouts = 0;
    ltdc.lineIrq = 0;
    ltdc.fifoUnderunIrq = 0;
    ltdc.transferErrorIrq = 0;
    ltdc.lastTicks = 0;
    ltdc.lineTicks = 0;
    ltdc.frameWait = 0;

    HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
    HAL_NVIC_EnableIRQ (LTDC_IRQn);

    // set line interupt line number
    LTDC->LIPCR = 0;

    // enable line interrupt
    LTDC->IER |= LTDC_IT_LI;
    }
    //}}}
  }
//}}}
//{{{
void cLcd::layerInit (uint8_t layer, uint32_t frameBufferAddress) {

  LTDC_LayerCfgTypeDef* curLayerCfg = &hLtdc.LayerCfg[layer];

  curLayerCfg->WindowX0 = 0;
  curLayerCfg->WindowX1 = getWidth();
  curLayerCfg->WindowY0 = 0;
  curLayerCfg->WindowY1 = getHeight();

  curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
  curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

  curLayerCfg->Alpha = 255;
  curLayerCfg->Alpha0 = 0;

  curLayerCfg->Backcolor.Blue = 0;
  curLayerCfg->Backcolor.Green = 0;
  curLayerCfg->Backcolor.Red = 0;

  curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

  curLayerCfg->ImageWidth = getWidth();
  curLayerCfg->ImageHeight = getHeight();

  HAL_LTDC_ConfigLayer (&hLtdc, curLayerCfg, layer);

  // local state
  curFrameBufferAddress = frameBufferAddress;
  setFrameBufferAddress[layer] = frameBufferAddress;
  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = 255;
  }
//}}}
//{{{
void cLcd::setFont (const uint8_t* font, int length) {

  FT_Init_FreeType (&FTlibrary);
  FT_New_Memory_Face (FTlibrary, (FT_Byte*)font, length, 0, &FTface);
  FTglyphSlot = FTface->glyph;
  //FT_Done_Face(face);
  //FT_Done_FreeType (library);
  }
//}}}

//{{{
void cLcd::setLayer (uint8_t layer, uint32_t frameBufferAddress) {

  curFrameBufferAddress = frameBufferAddress;
  setFrameBufferAddress[layer] = frameBufferAddress;
  }
//}}}
//{{{
void cLcd::showLayer (uint8_t layer, uint32_t frameBufferAddress, uint8_t alpha) {

  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = alpha;
  }
//}}}

//{{{
void cLcd::send() {

  // send first opCode using IRQhandler
  if (mBuffered)
    LCD_DMA2D_IRQHandler();
  }
//}}}
//{{{
void cLcd::wait() {

  if (mBuffered) {
    if (osSemaphoreWait (mDma2dSem, 500) != osOK)
      mDma2dTimeouts++;

    // zero out first opcode, point past it
    mDma2dCurBuf = mDma2dBuf;
    *mDma2dCurBuf++ = 0;
    }
  }
//}}}
//{{{
void cLcd::sendWait() {

  send();
  wait();
  }
//}}}

//{{{
void cLcd::reset() {

  for (auto i = 0; i < mMaxLine; i++)
    mLines[i].clear();

  mStartTime = osKernelSysTick();
  mLastLine = -1;
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTop() {
  mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::displayTail() {

  if (mLastLine > (int)mNumDrawLines-1)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  else
    mFirstLine = 0;
  }
//}}}
//{{{
void cLcd::updateNumDrawLines() {

  mStringPos = getLineHeight()*3;

  auto numDrawLines = getHeight() / getLineHeight();
  if (mShowTitle && !mTitle.empty())
    numDrawLines--;
  if (mShowLcdStats)
    numDrawLines--;
  if (mShowFooter)
    numDrawLines--;

  mNumDrawLines = numDrawLines;
  }
//}}}
